[
  {
    "section_number": "BNS Section 109",
    "section_title": "Attempt to murder.",
    "url": "https://devgan.in/bns/section/109/",
    "description": "IPC\nSection\n307\nWhoever does any act with such intention or knowledge, and under such circumstances that, if he by that act caused death, he would be guilty of murder, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine; and if hurt is caused to any person by such act, the offender shall be liable either to imprisonment for life, or to such punishment as is hereinbefore mentioned.\nWhen any person offending under sub-section (1) is under sentence of imprisonment for life, he may, if hurt is caused, be punished with death or with imprisonment for life, which shall mean the remainder of that person’s natural life.",
    "illustrations": "A shoots at Z with intention to kill him, under such circumstances that, if death ensued A would be guilty of murder. A is liable to punishment under this section.\nA, with the intention of causing the death of a child of tender years, exposes it in a desert place. A has committed the offence defined by this section, though the death of the child does not ensue.\nA, intending to murder Z, buys a gun and loads it. A has not yet committed the offence. A fires the gun at Z. He has committed the offence defined in this section, and, if by such firing he wounds Z, he is liable to the punishment provided by the latter part of the first paragraph of this section.\nA, intending to murder Z by poison, purchases poison and mixes the same with food which remains in A’s keeping; A has not yet committed the offence defined in this section. A places the food on Z’s table or delivers it to Z’s servants to place it on Z’s table. A has committed the offence defined in this section."
  },
  {
    "section_number": "BNS Section 80",
    "section_title": "Dowry death.",
    "url": "https://devgan.in/bns/section/80/",
    "description": "Where the death of a woman is caused by any burns or bodily injury or occurs otherwise than under normal circumstances within seven years of her marriage and it is shown that soon before her death she was subjected to cruelty or harassment by her husband or any relative of her husband for, or in connection with, any demand for dowry, such death shall be called “dowry death”, and such husband or relative shall be deemed to have caused her death.\nExplanation:\nFor the purposes of this sub-section, “dowry” shall have the same meaning as in section 2 of the Dowry Prohibition Act, 1961.\nWhoever commits dowry death shall be punished with imprisonment for a term which shall not be less than seven years but which may extend to imprisonment for life.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 176",
    "section_title": "Illegal payments in connection with an election.",
    "url": "https://devgan.in/bns/section/176/",
    "description": "Whoever without the general or special authority in writing of a candidate incurs or authorises expenses on account of the holding of any public meeting, or upon any advertisement, circular or publication, or in any other way whatsoever for the purpose of promoting or procuring the election of such candidate, shall be punished with fine which may extend to ten thousand rupees;\nProvided\nthat if any person having incurred any such expenses not exceeding the amount of ten rupees without authority obtains within ten days from the date on which such expenses were incurred the approval in writing of the candidate, he shall be deemed to have incurred such expenses with the authority of the candidate.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 103",
    "section_title": "Punishment for murder.",
    "url": "https://devgan.in/bns/section/103/",
    "description": "IPC\nSection\n302\nWhoever commits murder shall be punished with death or imprisonment for life, and shall also be liable to fine.\nWhen a group of five or more persons acting in concert commits murder on the ground of race, caste or community, sex, place of birth, language, personal belief or any other ground each member of such group shall be punished with death or with imprisonment for life or imprisonment for a term which shall not be less than seven years, and shall also be liable to fine.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 64",
    "section_title": "Punishment for rape.",
    "url": "https://devgan.in/bns/section/64/",
    "description": "IPC\nSection\n376\nWhoever, except in the cases provided for in sub-section (2), commits rape, shall be punished with rigorous imprisonment of either description for a term which shall not be less than ten years, but which may extend to imprisonment for life, and shall also be liable to fine.\nWhoever,\nbeing a police officer, commits rape,\nwithin the limits of the police station to which such police officer is appointed; or\nin the premises of any station house; or\non a woman in such police officer’s custody or in the custody of a police officer subordinate to such police officer; or\nbeing a public servant, commits rape on a woman in such public servant’s custody or in the custody of a public servant subordinate to such public servant; or\nbeing a member of the armed forces deployed in an area by the Central Government or a State Government commits rape in such area; or\nbeing on the management or on the staff of a jail, remand home or other place of custody established by or under any law for the time being in force or of a women’s or children’s institution, commits rape on any inmate of such jail, remand home, place or institution; or\nbeing on the management or on the staff of a hospital, commits rape on a woman in that hospital; or\nbeing a relative, guardian or teacher of, or a person in a position of trust or authority towards the woman, commits rape on such woman; or\ncommits rape during communal or sectarian violence; or\ncommits rape on a woman knowing her to be pregnant; or\ncommits rape, on a woman incapable of giving consent; or\nbeing in a position of control or dominance over a woman, commits rape on such woman; or\ncommits rape on a woman suffering from mental illness or physical disability; or\nwhile committing rape causes grievous bodily harm or maims or disfigures or endangers the life of a woman; or\ncommits rape repeatedly on the same woman, shall be punished with rigorous imprisonment for a term which shall not be less than ten years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, and shall also be liable to fine.\nExplanation:\nFor the purposes of this sub-section,\n“armed forces” means the naval, army and air forces and includes any member of the Armed Forces constituted under any law for the time being in force, including the paramilitary forces and any auxiliary forces that are under the control of the Central Government or the State Government;\n“hospital” means the precincts of the hospital and includes the precincts of any institution for the reception and treatment of persons during convalescence or of persons requiring medical attention or rehabilitation;\n“police officer” shall have the same meaning as assigned to the expression “police” under the Police Act, 1861;\n“women’s or children’s institution” means an institution, whether called an orphanage or a home for neglected women or children or a widow’s home or an institution called by any other name, which is established and maintained for the reception and care of women or children.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 65",
    "section_title": "Punishment for rape in certain cases.",
    "url": "https://devgan.in/bns/section/65/",
    "description": "Whoever, commits rape on a woman under sixteen years of age shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, and shall also be liable to fine;\nProvided\nthat such fine shall be just and reasonable to meet the medical expenses and rehabilitation of the victim;\nProvided further\nthat any fine imposed under this sub-section shall be paid to the victim.\nWhoever, commits rape on a woman under twelve years of age shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, and with fine or with death;\nProvided\nthat such fine shall be just and reasonable to meet the medical expenses and rehabilitation of the victim;\nProvided further\nthat any fine imposed under this section shall be paid to the victim.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 66",
    "section_title": "Punishment for causing death or resulting in persistent vegetative state of victim.",
    "url": "https://devgan.in/bns/section/66/",
    "description": "IPC\nSection\n376A\nWhoever, commits an offence punishable under sub-section (1) or sub-section (2) of section\n64\nand in the course of such commission inflicts an injury which causes the death of the woman or causes the woman to be in a persistent vegetative state, shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, or with death.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 67",
    "section_title": "Sexual intercourse by husband upon his wife during separation.",
    "url": "https://devgan.in/bns/section/67/",
    "description": "IPC\nSection\n376B\nWhoever has sexual intercourse with his own wife, who is living separately, whether under a decree of separation or otherwise, without her consent, shall be punished with imprisonment of either description for a term which shall not be less than two years but which may extend to seven years, and shall also be liable to fine.\nExplanation:\nIn this section, “sexual intercourse” shall mean any of the acts mentioned in clauses (a) to (d) of section\n63\n.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 68",
    "section_title": "Sexual intercourse by a person in authority.",
    "url": "https://devgan.in/bns/section/68/",
    "description": "IPC\nSection\n376C\nWhoever, being:\nin a position of authority or in a fiduciary relationship; or\na public servant; or\nsuperintendent or manager of a jail, remand home or other place of custody established by or under any law for the time being in force, or a women’s or children’s institution; or\non the management of a hospital or being on the staff of a hospital, abuses such position or fiduciary relationship to induce or seduce any woman either in his custody or under his charge or present in the premises to have sexual intercourse with him, such sexual intercourse not amounting to the offence of rape, shall be punished with rigorous imprisonment of either description for a term which shall not be less than five years, but which may extend to ten years, and shall also be liable to fine.\nExplanation 1:\nIn this section, “sexual intercourse” shall mean any of the acts mentioned in clauses (a) to (d) of section\n63\n.\nExplanation 2:\nFor the purposes of this section, Explanation 1 to section\n63\nshall also be applicable.\nExplanation 3:\n“Superintendent”, in relation to a jail, remand home or other place of custody or a women’s or children’s institution, includes a person holding any other office in such jail, remand home, place or institution by virtue of which such person can exercise any authority or control over its inmates.\nExplanation 4:\nThe expressions “hospital” and “women’s or children’s institution” shall respectively have the same meaning as in Explanation to sub-section (2) of section\n64\n.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 69",
    "section_title": "Sexual intercourse by employing deceitful means etc.",
    "url": "https://devgan.in/bns/section/69/",
    "description": "Whoever, by deceitful means or by making promise to marry a woman without any intention of fulfilling the same, and has sexual intercourse with her, such sexual intercourse not amounting to the offence of rape, shall be punished with imprisonment of either description for a term which may extend to ten years and shall also be liable to fine.\nExplanation:\n“deceitful means” shall include the false promise of employment or promotion, inducement or marring after suppressing identity.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 70",
    "section_title": "Gang rape.",
    "url": "https://devgan.in/bns/section/70/",
    "description": "IPC\nSection\n376D\nWhere a woman is raped by one or more persons constituting a group or acting in furtherance of a common intention, each of those persons shall be deemed to have committed the offence of rape and shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to life which shall mean imprisonment for the remainder of that person’s natural life, and with fine;\nProvided\nthat such fine shall be just and reasonable to meet the medical expenses and rehabilitation of the victim;\nProvided further\nthat any fine imposed under this sub-section shall be paid to the victim.\nWhere a woman under eighteen years of age is raped by one or more persons constituting a group or acting in furtherance of a common intention, each of those persons shall be deemed to have committed the offence of rape and shall be punished with imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, and with fine, or with death;\nProvided\nthat such fine shall be just and reasonable to meet the medical expenses and rehabilitation of the victim;\nProvided further\nthat any fine imposed under this sub-section shall be paid to the victim.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 71",
    "section_title": "Punishment for repeat offenders.",
    "url": "https://devgan.in/bns/section/71/",
    "description": "Whoever has been previously convicted of an offence punishable under section\n64\nor section\n65\nor section\n66\nor section\n67\nand is subsequently convicted of an offence punishable under any of the said sections shall be punished with imprisonment for life which shall mean imprisonment for the remainder of that person’s natural life, or with death.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 74",
    "section_title": "Assault or criminal force to woman with intent to outrage her modesty.",
    "url": "https://devgan.in/bns/section/74/",
    "description": "Whoever assaults or uses criminal force to any woman, intending to outrage or knowing it to be likely that he will there by outrage her modesty, shall be punished with imprisonment of either description for a term which shall not be less than one year but which may extend to five years, and shall also be liable to fine.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 75",
    "section_title": "Sexual harassment.",
    "url": "https://devgan.in/bns/section/75/",
    "description": "A man committing any of the following act:\nphysical contact and advances involving unwelcome and explicit sexual overtures; or\na demand or request for sexual favours; or\nshowing pornography against the will of a woman; or\nmaking sexually coloured remarks, shall be guilty of the offence of sexual harassment.\nAny man who commits the offence specified in clause (i) or clause (ii) or clause (iii) of sub-section (1) shall be punished with rigorous imprisonment for a term which may extend to three years, or with fine, or with both.\nAny man who commits the offence specified in clause (iv) of sub-section (1) shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 76",
    "section_title": "Assault or use of criminal force to woman with intent to disrobe.",
    "url": "https://devgan.in/bns/section/76/",
    "description": "Whoever assaults or uses criminal force to any woman or abets such act with the intention of disrobing or compelling her to be naked, shall be punished with imprisonment of either description for a term which shall not be less than three years but which may extend to seven years, and shall also be liable to fine.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 77",
    "section_title": "Voyeurism.",
    "url": "https://devgan.in/bns/section/77/",
    "description": "Whoever watches, or captures the image of a woman engaging in a private act in circumstances where she would usually have the expectation of not being observed either by the perpetrator or by any other person at the behest of the perpetrator or disseminates such image shall be punished on first conviction with imprisonment of either description for a term which shall not be less than one year, but which may extend to three years, and shall also be liable to fine, and be punished on a second or subsequent conviction, with imprisonment of either description for a term which shall not be less than three years, but which may extend to seven years, and shall also be liable to fine.\nExplanation 1:\nFor the purpose of this section, “private act” includes an act of watching carried out in a place which, in the circumstances, would reasonably be expected to provide privacy and where the victim’s genitals, posterior or breasts are exposed or covered only in underwear; or the victim is using a lavatory; or the victim is doing a sexual act that is not of a kind ordinarily done in public.\nExplanation 2:\nWhere the victim consents to the capture of the images or any act, but not to their dissemination to third persons and where such image or act is disseminated, such dissemination shall be considered an offence under this section.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 78",
    "section_title": "Stalking.",
    "url": "https://devgan.in/bns/section/78/",
    "description": "Any man who,\nfollows a woman and contacts, or attempts to contact such woman to foster personal interaction repeatedly despite a clear indication of disinterest by such woman; or\nmonitors the use by a woman of the internet, e-mail or any other form of electronic communication, commits the offence of stalking;\nProvided\nthat such conduct shall not amount to stalking if the man who pursued it proves that,\nit was pursued for the purpose of preventing or detecting crime and the man accused of stalking had been entrusted with the responsibility of prevention and detection of crime by the State; or\nit was pursued under any law or to comply with any condition or requirement imposed by any person under any law; or\nin the particular circumstances such conduct was reasonable and justified.\nWhoever commits the offence of stalking shall be punished on first conviction with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine; and be punished on a second or subsequent conviction, with imprisonment of either description for a term which may extend to five years, and shall also be liable to fine.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 79",
    "section_title": "Word, gesture or act intended to insult the modesty of a woman.",
    "url": "https://devgan.in/bns/section/79/",
    "description": "Whoever, intending to insult the modesty of any woman, utters any words, makes any sound or gesture, or exhibits any object in any form, intending that such word or sound shall be heard, or that such gesture or object shall be seen, by such woman, or intrudes upon the privacy of such woman, shall be punished with simple imprisonment for a term which may extend to three years, and also with fine.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 85",
    "section_title": "Husband or relative of husband of a woman subjecting her to cruelty.",
    "url": "https://devgan.in/bns/section/85/",
    "description": "Whoever, being the husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished with imprisonment for a term which may extend to three years and shall also be liable to fine.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 124",
    "section_title": "Voluntarily causing grievous hurt by use of acid, etc.",
    "url": "https://devgan.in/bns/section/124/",
    "description": "Whoever causes permanent or partial damage or deformity to, or burns or maims or disfigures or disables, any part or parts of the body of a person or causes grievous hurt by throwing acid on or by administering acid to that person, or by using any other means with the intention of causing or with the knowledge that he is likely to cause such injury or hurt or causes a person to be in a permanent vegetative state shall be punished with imprisonment of either description for a term which shall not be less than ten years but which may extend to imprisonment for life, and with fine;\nProvided\nthat such fine shall be just and reasonable to meet the medical expenses of the treatment of the victim;\nProvided further\nthat any fine imposed under this section shall be paid to the victim.\nWhoever throws or attempts to throw acid on any person or attempts to administer acid to any person, or attempts to use any other means, with the intention of causing permanent or partial damage or deformity or burns or maiming or disfigurement or disability or grievous hurt to that person, shall be punished with imprisonment of either description for a term which shall not be less than five years but which may extend to seven years, and shall also be liable to fine.\nExplanation 1:\nFor the purposes of this section, “acid” includes any substance which has acidic or corrosive character or burning nature, that is capable of causing bodily injury leading to scars or disfigurement or temporary or permanent disability.\nExplanation 2:\nFor the purposes of this section, permanent or partial damage or deformity or permanent vegetative state, shall not be required to be irreversible.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 303",
    "section_title": "Theft.",
    "url": "https://devgan.in/bns/section/303/",
    "description": "Whoever, intending to take dishonestly any movable property out of the possession of any person without that person’s consent, moves that property in order to such taking, is said to commit theft.\nExplanation 1:\nA thing so long as it is attached to the earth, not being movable property, is not the subject of theft; but it becomes capable of being the subject of theft as soon as it is severed from the earth.\nExplanation 2:\nA moving effected by the same act which effects the severance may be a theft.\nExplanation 3:\nA person is said to cause a thing to move by removing an obstacle which prevented it from moving or by separating it from any other thing, as well as by actually moving it.\nExplanation 4:\nA person, who by any means causes an animal to move, is said to move that animal, and to move everything which, in consequence of the motion so caused, is moved by that animal.\nExplanation 5:\nThe consent mentioned in this section may be express or implied, and may be given either by the person in possession, or by any person having for that purpose authority either express or implied.",
    "illustrations": "A cuts down a tree on Z’s ground, with the intention of dishonestly taking the tree out of Z’s possession without Z’s consent. Here, as soon as A has severed the tree in order to such taking, he has committed theft.\nA puts a bait for dogs in his pocket, and thus induces Z’s dog to follow it. Here, if A’s intention be dishonestly to take the dog out of Z’s possession without Z’s consent, A has committed theft as soon as Z’s dog has begun to follow A.\nA meets a bullock carrying a box of treasure. He drives the bullock in a certain direction, in order that he may dishonestly take the treasure. As soon as the bullock begins to move, A has committed theft of the treasure.\nA being Z’s servant, and entrusted by Z with the care of Z’s plate, dishonestly runs away with the plate, without Z’s consent. A has committed theft.\nZ, going on a journey, entrusts his plate to A, the keeper of a warehouse, till Z shall return. A carries the plate to a goldsmith and sells it. Here the plate was not in Z’s possession. It could not therefore be taken out of Z’s possession, and A has not committed theft, though he may have committed criminal breach of trust.\nA finds a ring belonging to Z on a table in the house which Z occupies. Here the ring is in Z’s possession, and if A dishonestly removes it, A commits theft.\nA finds a ring lying on the highroad, not in the possession of any person. A, by taking it, commits no theft, though he may commit criminal misappropriation of property.\nA sees a ring belonging to Z lying on a table in Z’s house. Not venturing to misappropriate the ring immediately for fear of search and detection, A hides the ring in a place where it is highly improbable that it will ever be found by Z, with the intention of taking the ring from the hiding place and selling it when the loss is forgotten. Here A, at the time of first moving the ring, commits theft.\nA delivers his watch to Z, a jeweler, to be regulated. Z carries it to his shop. A, not owing to the jeweler any debt for which the jeweler might lawfully detain the watch as a security, enters the shop openly, takes his watch by force out of Z’s hand, and carries it away. Here A, though he may have committed criminal trespass and assault, has not committed theft, inasmuch as what he did was not done dishonestly.\nIf A owes money to Z for repairing the watch, and if Z retains the watch lawfully as a security for the debt, and A takes the watch out of Z’s possession, with the intention of depriving Z of the property as a security for his debt, he commits theft, inasmuch as he takes it dishonestly.\nAgain, if A, having pawned his watch to Z, takes it out of Z’s possession without Z’s consent, not having paid what he borrowed on the watch, he commits theft, though the watch is his own property inasmuch as he takes it dishonestly.\nA takes an article belonging to Z out of Z’s possession without Z’s consent, with the intention of keeping it until he obtains money from Z as a reward for its restoration. Here A takes dishonestly; A has therefore committed theft.\nA, being on friendly terms with Z, goes into Z’s library in Z’s absence, and takes away a book without Z’s express consent for the purpose merely of reading it, and with the intention of returning it. Here, it is probable that A may have conceived that he had Z’s implied consent to use Z’s book. If this was A’s impression, A has not committed theft.\nA asks charity from Z’s wife. She gives A money, food and clothes, which A knows to belong to Z her husband. Here it is probable that A may conceive that Z’s wife is authorised to give away alms. If this was A’s impression, A has not committed theft.\nA is the paramour of Z’s wife. She gives a valuable property, which A knows to belong to her husband Z, and to be such property as she has no authority from Z to give. If A takes the property dishonestly, he commits theft.\nA, in good faith, believing property belonging to Z to be A’s own property, takes that property out of Z’s possession. Here, as A does not take dishonestly, he does not commit theft.\nWhoever commits theft shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both and in case of second or subsequent conviction of any person under this section, he shall be punished with rigorous imprisonment for a term which shall not be less than one year but which may extend to five years and with fine;\nProvided\nthat in cases of theft where the value of the stolen property is less than five thousand rupees, and a person is convicted for the first time, shall upon return of the value of property or restoration of the stolen property, shall be punished with community service."
  },
  {
    "section_number": "BNS Section 304",
    "section_title": "Snatching.",
    "url": "https://devgan.in/bns/section/304/",
    "description": "Theft is “snatching” if, in order to commit theft, the offender suddenly or quickly or forcibly seizes or secures or grabs or takes away from any person or from his possession any moveable property.\nWhoever commits snatching, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 305",
    "section_title": "Theft in a dwelling house, or means of transportation or place of worship, etc.",
    "url": "https://devgan.in/bns/section/305/",
    "description": "Whoever commits theft,\nin any building, tent or vessel used as a human dwelling or used for the custody of property; or\nof any means of transport used for the transport of goods or passengers; or\nof any article or goods from any means of transport used for the transport of goods or passengers; or\nof idol or icon in any place of worship; or\nof any property of the Government or of a local authority, shall be punished with imprisonment of either description for a term which may extend to seven years and shall also be liable to fine.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 316",
    "section_title": "Criminal breach of trust.",
    "url": "https://devgan.in/bns/section/316/",
    "description": "Whoever, being in any manner entrusted with property, or with any dominion over property, dishonestly misappropriates or converts to his own use that property, or dishonestly uses or disposes of that property in violation of any direction of law prescribing the mode in which such trust is to be discharged, or of any legal contract, express or implied, which he has made touching the discharge of such trust, or wilfully suffers any other person so to do, commits “criminal breach of trust”.\nExplanation 1:\nA person, being an employer of an establishment whether exempted under section 17 of the Employees’ Provident Funds and Miscellaneous Provisions Act, 1952 or not who deducts the employee’s contribution from the wages payable to the employee for credit to a Provident Fund or Family Pension Fund established by any law for the time being in force, shall be deemed to have been entrusted with the amount of the contribution so deducted by him and if he makes default in the payment of such contribution to the said Fund in violation of the said law, shall be deemed to have dishonestly used the amount of the said contribution in violation of a direction of law as aforesaid.\nExplanation 2:\nA person, being an employer, who deducts the employees’ contribution from the wages payable to the employee for credit to the Employees’ State Insurance Fund held and administered by the Employees’ State Insurance Corporation established under the Employees’ State Insurance Act, 1948 shall be deemed to have been entrusted with the amount of the contribution so deducted by him and if he makes default in the payment of such contribution to the said Fund in violation of the said Act, shall be deemed to have dishonestly used the amount of the said contribution in violation of a direction of law as aforesaid.",
    "illustrations": "A, being executor to the will of a deceased person, dishonestly disobeys the law which directs him to divide the effects according to the will, and appropriates them to his own use. A has committed criminal breach of trust.\nA is a warehouse-keeper Z going on a journey, entrusts his furniture to A, under a contract that it shall be returned on payment of a stipulated sum for warehouse room. A dishonestly sells the goods. A has committed criminal breach of trust.\nA, residing in Kolkata, is agent for Z, residing at Delhi. There is an express or implied contract between A and Z, that all sums remitted by Z to A shall be invested by A, according to Z’s direction. Z remits a lakh of rupees to A, with directions to A to invest the same in Company’s paper. A dishonestly disobeys the directions and employs the money in his own business. A has committed criminal breach of trust.\nBut if A, in illustration (c ), not dishonestly but in good faith, believing that it will be more for Z’s advantage to hold shares in the Bank of Bengal, disobeys Z’s directions, and buys shares in the Bank of Bengal, for Z, instead of buying Company’s paper, here, though Z should suffer loss, and should be entitled to bring a civil action against A, on account of that loss, yet A, not having acted dishonestly, has not committed criminal breach of trust.\nA, a revenue-officer, is entrusted with public money and is either directed by law, or bound by a contract, express or implied, with the Government, to pay into a certain treasury all the public money which he holds. A dishonestly appropriates the money. A has committed criminal breach of trust.\nA, a carrier, is entrusted by Z with property to be carried by land or by water. A dishonestly misappropriates the property. A has committed criminal breach of trust.\nWhoever, commits criminal breach of trust shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.\nWhoever, being entrusted with property as a carrier, wharfinger or warehousekeeper, commits criminal breach of trust in respect of such property, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.\nWhoever, being a clerk or servant or employed as a clerk or servant, and being in any manner entrusted in such capacity with property, or with any dominion over property, commits criminal breach of trust in respect of that property, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.\nWhoever, being in any manner entrusted with property, or with any dominion over property in his capacity of a public servant or in the way of his business as a banker, merchant, factor, broker, attorney or agent commits criminal breach of trust in respect of that property, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "section_number": "BNS Section 318",
    "section_title": "Cheating.",
    "url": "https://devgan.in/bns/section/318/",
    "description": "Whoever, by deceiving any person, fraudulently or dishonestly induces the person so deceived to deliver any property to any person, or to consent that any person shall retain any property, or intentionally induces the person so deceived to do or omit to do anything which he would not do or omit if he were not so deceived, and which act or omission causes or is likely to cause damage or harm to that person in body, mind, reputation or property, is said to “cheat”.\nExplanation:\nA dishonest concealment of facts is a deception within the meaning of this section.",
    "illustrations": "A, by falsely pretending to be in the Civil Service, intentionally deceives Z, and thus dishonestly induces Z to let him have on credit goods for which he does not mean to pay. A cheats.\nA, by putting a counterfeit mark on an article, intentionally deceives Z into a belief that this article was made by a certain celebrated manufacturer, and thus dishonestly induces Z to buy and pay for the article. A cheats.\nA, by exhibiting to Z a false sample of an article intentionally deceives Z into believing that the article corresponds with the sample, and thereby dishonestly induces Z to buy and pay for the article. A cheats.\nA, by tendering in payment for an article a bill on a house with which A keeps no money, and by which A expects that the bill will be dishonoured, intentionally deceives Z, and thereby dishonestly induces Z to deliver the article, intending not to pay for it. A cheats.\nA, by pledging as diamond articles which he knows are not diamonds, intentionally deceives Z, and thereby dishonestly induces Z to lend money. A cheats.\nA intentionally deceives Z into a belief that A means to repay any money that Z may lend to him and thereby dishonestly induces Z to lend him money, A not intending to repay it. A cheats.\nA intentionally deceives Z into a belief that A means to deliver to Z a certain quantity of indigo plant which he does not intend to deliver, and thereby dishonestly induces Z to advance money upon the faith of such delivery. A cheats; but if A, at the time of obtaining the money, intends to deliver the indigo plant, and afterwards breaks his contract and does not deliver it, he does not cheat, but is liable only to a civil action for breach of contract.\nA intentionally deceives Z into a belief that A has performed A’s part of a contract made with Z, which he has not performed, and thereby dishonestly induces Z to pay money. A cheats.\nA sells and conveys an estate to B. A, knowing that in consequence of such sale he has no right to the property, sells or mortgages the same to Z, without disclosing the fact of the previous sale and conveyance to B, and receives the purchase or mortgage money from Z. A cheats.\nWhoever cheats shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.\nWhoever cheats with the knowledge that he is likely thereby to cause wrongful loss to a person whose interest in the transaction to which the cheating relates, he was bound, either by law, or by a legal contract, to protect, shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.\nWhoever cheats and thereby dishonestly induces the person deceived to deliver any property to any person, or to make, alter or destroy the whole or any part of a valuable security, or anything which is signed or sealed, and which is capable of being converted into a valuable security, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "section_number": "BNS Section 324",
    "section_title": "Mischief.",
    "url": "https://devgan.in/bns/section/324/",
    "description": "Whoever with intent to cause, or knowing that he is likely to cause, wrongful loss or damage to the public or to any person, causes the destruction of any property, or any such change in any property or in the situation thereof as destroys or diminishes its value or utility, or affects it injuriously, commits “mischief”.\nExplanation 1:\nIt is not essential to the offence of mischief that the offender should intend to cause loss or damage to the owner of the property injured or destroyed. It is sufficient if he intends to cause, or knows that he is likely to cause, wrongful loss or damage to any person by injuring any property, whether it belongs to that person or not.\nExplanation 2:\nMischief may be committed by an act affecting property belonging to the person who commits the act, or to that person and others jointly.",
    "illustrations": "A voluntarily burns a valuable security belonging to Z intending to cause wrongful loss to Z. A has committed mischief.\nA introduces water in to an ice-house belonging to Z and thus causes the ice to melt, intending wrongful loss to Z. A has committed mischief.\nA voluntarily throws into a river a ring belonging to Z, with the intention of thereby causing wrongful loss to Z. A has committed mischief.\nA, knowing that his effects are about to be taken in execution in order to satisfy a debt due from him to Z, destroys those effects, with the intention of thereby preventing Z from obtaining satisfaction of the debt, and of thus causing damage to Z. A has committed mischief.\nA having insured a ship, voluntarily causes the same to be cast away, with the intention of causing damage to the underwriters. A has committed mischief.\nA cause a ship to be cast away, intending thereby to cause damage to Z who has lent money on bottomry on the ship. A has committed mischief.\nA, having joint property with Z in a horse, shoots the horse, intending thereby to cause wrongful loss to Z. A has committed mischief.\nA causes cattle to enter upon a field belonging to Z, intending to cause and knowing that he is likely to cause damage to Z’s crop. A has committed mischief.\nWhoever commits mischief shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.\nWhoever commits mischief and thereby causes loss or damage to any property including the property of Government or Local Authority shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.\nWhoever commits mischief and thereby causes loss or damage to the amount of twenty thousand rupees and more but less than one lakh rupees shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\nWhoever commits mischief and thereby causes loss or damage to the amount of one lakh rupees or upwards, shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.\nWhoever commits mischief, having made preparation for causing to any person death, or hurt, or wrongful restraint, or fear of death, or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for a term which may extend to five years, and shall also be liable to fine."
  },
  {
    "section_number": "BNS Section 115",
    "section_title": "Voluntarily causing hurt.",
    "url": "https://devgan.in/bns/section/115/",
    "description": "Whoever does any act with the intention of thereby causing hurt to any person, or with the knowledge that he is likely thereby to cause hurt to any person, and does thereby cause hurt to any person, is said “voluntarily to cause hurt”.\nWhoever, except in the case provided for by sub- section (1) of section\n120\nvoluntarily causes hurt, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to ten thousand rupees, or with both.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 352",
    "section_title": "Intentional insult with intent to provoke breach of peace.",
    "url": "https://devgan.in/bns/section/352/",
    "description": "Whoever intentionally insults in any manner, and thereby gives provocation to any person, intending or knowing it to be likely that such provocation will cause him to break the public peace, or to commit any other offence, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 351",
    "section_title": "Criminal intimidation.",
    "url": "https://devgan.in/bns/section/351/",
    "description": "Whoever threatens by any means, another with any injury to his person, reputation or property, or to the person or reputation of any one in whom that person is interested, with intent to cause alarm to that person, or to cause that person to do any act which he is not legally bound to do, or to omit to do any act which that person is legally entitled to do, as the means of avoiding the execution of such threat, commits criminal intimidation.\nExplanation:\nA threat to injure the reputation of any deceased person in whom the person threatened is interested, is within this section.\nIllustration:\nA, for the purpose of inducing B to resist from prosecuting a civil suit, threatens to burn B’s house. A is guilty of criminal intimidation.\nWhoever commits the offence of criminal intimidation shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\nWhoever commits the offence of criminal intimidation by treating to cause death or grievous hurt, or to cause the destruction of any property by fire, or to cause an offence punishable with death or imprisonment for life, or with imprisonment for a term which may extend to seven years, or to impute unchastity to a woman, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both.\nWhoever commits the offence of criminal intimidation by an anonymous communication, or having taken precaution to conceal the name or abode of the person from whom the threat comes, shall be punished with imprisonment of either description for a term which may extend to two years, in addition to the punishment provided for the offence under sub-section (1).",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 60",
    "section_title": "Concealing design to commit offence punishable with imprisonment.",
    "url": "https://devgan.in/bns/section/60/",
    "description": "IPC\nSection\n120\nWhoever, intending to facilitate or knowing it to be likely that he will thereby facilitate the commission of an offence punishable with imprisonment, voluntarily conceals, by any act or illegal omission, the existence of a design to commit such offence, or makes any representation which he knows to be false respecting such design shall,\nif the offence be committed, be punished with imprisonment of the description provided for the offence, for a term which may extend to one-fourth; and\nif the offence be not committed, to one-eighth, of the longest term of such imprisonment, or with such fine as is provided for the offence, or with both.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 61",
    "section_title": "Criminal conspiracy.",
    "url": "https://devgan.in/bns/section/61/",
    "description": "When two or more persons agree to do, or cause to be done,\nan illegal act; or\nan act which is not illegal by illegal means, such an agreement is designated a criminal conspiracy;\nProvided\nthat no agreement except an agreement to commit an offence shall amount to a criminal conspiracy unless some act besides the agreement is done by one or more parties to such agreement in pursuance thereof.\nExplanation:\nIt is immaterial whether the illegal act is the ultimate object of such agreement, or is merely incidental to that object.\nWhoever is a party to a criminal conspiracy,\nto commit an offence punishable with death, imprisonment for life or rigorous imprisonment for a term of two years or upwards, shall, where no express provision is made in this Sanhita for the punishment of such a conspiracy, be punished in the same manner as if he had abetted such offence;\nother than a criminal conspiracy to commit an offence punishable as aforesaid shall be punished with imprisonment of either description for a term not exceeding six months, or with fine or with both.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 189",
    "section_title": "Unlawful assembly.",
    "url": "https://devgan.in/bns/section/189/",
    "description": "An assembly of five or more persons is designated an “unlawful assembly”, if the common object of the persons composing that assembly is\nto overawe by criminal force, or show of criminal force, the Central Government or any State Government or Parliament or the Legislature of any State, or any public servant in the exercise of the lawful power of such public servant; or\nto resist the execution of any law, or of any legal process; or\nto commit any mischief or criminal trespass, or other offence; or\nby means of criminal force, or show of criminal force, to any person, to take or obtain possession of any property, or to deprive any person of the enjoyment of a right of way, or of the use of water or other incorporeal right of which he is in possession or enjoyment, or to enforce any right or supposed right; or\nby means of criminal force, or show of criminal force, to compel any person to do what he is not legally bound to do, or to omit to do what he is legally entitled to do.\nExplanation:\nAn assembly which was not unlawful when it assembled, may subsequently become an unlawful assembly.\nWhoever, being aware of facts which render any assembly an unlawful assembly, intentionally joins that assembly, or continues in it, is said to be a member of an unlawful assembly and such member shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.\nWhoever joins or continues in an unlawful assembly, knowing that such unlawful assembly has been commanded in the manner prescribed by law to disperse, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\nWhoever, being armed with any deadly weapon, or with anything which, used as a weapon of offence, is likely to cause death, is a member of an unlawful assembly, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\nWhoever knowingly joins or continues in any assembly of five or more persons likely to cause a disturbance of the public peace, after such assembly has been lawfully commanded to disperse, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.\nExplanation:\nIf the assembly is an unlawful assembly within the meaning of sub-section (1), the offender shall be punishable under sub-section (3).\nWhoever hires or engages, or employs, or promotes, or connives at the hiring, engagement or employment of any person to join or become a member of any unlawful assembly, shall be punishable as a member of such unlawful assembly, and for any offence which may be committed by any such person as a member of such unlawful assembly in pursuance of such hiring, engagement or employment, in the same manner as if he had been a member of such unlawful assembly, or himself had committed such offence.\nWhoever harbours, receives or assembles, in any house or premises in his occupation or charge, or under his control any persons knowing that such persons have been hired, engaged or employed, or are about to be hired, engaged or employed, to join or become members of an unlawful assembly, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.\nWhoever is engaged, or hired, or offers or attempts to be hired or engaged, to do or assist in doing any of the acts specified in sub-section (1), shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.\nWhoever, being so engaged or hired as referred to in sub-section (8), goes armed, or engages or offers to go armed, with any deadly weapon or with anything which used as a weapon of offence is likely to cause death, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 191",
    "section_title": "Rioting.",
    "url": "https://devgan.in/bns/section/191/",
    "description": "Whenever force or violence is used by an unlawful assembly, or by any member thereof, in prosecution of the common object of such assembly, every member of such assembly is guilty of the offence of rioting.\nWhoever is guilty of rioting, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\nWhoever is guilty of rioting, being armed with a deadly weapon or with anything which, used as a weapon of offence, is likely to cause death, shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 298",
    "section_title": "Injuring or defiling place of worship, with intent to insult the religion of any class.",
    "url": "https://devgan.in/bns/section/298/",
    "description": "Whoever destroys, damages or defiles any place of worship, or any object held sacred by any class of persons with the intention of thereby insulting the religion of any class of persons or with the knowledge that any class of persons is likely to consider such destruction, damage or defilement as an insult to their religion, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
    "illustrations": ""
  },
  {
    "section_number": "BNS Section 299",
    "section_title": "Deliberate and malicious acts, intended to outrage religious feelings of any class by insulting its religion or religious beliefs.",
    "url": "https://devgan.in/bns/section/299/",
    "description": "Whoever, with deliberate and malicious intention of outraging the religious feelings of any class of citizens of India, by words, either spoken or written, or by signs or by visible representations or through electronic means or otherwise, insults or attempts to insult the religion or the religious beliefs of that class, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
    "illustrations": ""
  }
]